Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Export relational schema
sv: Exportera relationsschema

source: The number of logical read requests InnoDB has done.
sv: Antalet logiska läsefterfrågningar som InnoDB har gjort.

source: Tab that is displayed when entering a server.
sv: Flik som visas när du går till en server.

source: Sit tight! It may take few seconds depending on data size and column count of the table.
sv: Bara lugn! Det kan ta några sekunder beroende på data och kolumn räkna i tabellen.

source: Free swap
sv: Ledigt växlingsutrymme

source: Last check
sv: Senaste kontroll

source: Converts an Internet network address stored as a binary string into a string in Internet standard (IPv4/IPv6) format.
sv: Konverterar en Internet nätverksadress lagras som en binär sträng till en sträng i Internet standardformat (IPv4/IPv6).

source: It is usually sufficient to set {innodb_log_file_size} to 25% of the size of {innodb_buffer_pool_size}. A very big {innodb_log_file_size} slows down the recovery time after a database crash considerably. See also <a href="https://www.percona.com/blog/2006/07/03/choosing-proper-innodb_log_file_size/">this Article</a>. You need to shutdown the server, remove the InnoDB log files, set the new value in my.cnf, start the server, then check the error logs if everything went fine. See also <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">this blog entry</a>
sv: Det räcker vanligtvis att ange {innodb_log_file_size} till 25 % av storleken på {innodb_buffer_pool_size}. En mycket stor {innodb_log_file_size} förlänger återställningstiden avsevärt efter en databaskrasch. Se även <a href="https://www.percona.com/blog/2006/07/03/choosing-proper-innodb_log_file_size/">den här artikeln</a>. Stäng av servern, ta bort InnoDB-loggfilerna, ange det nya värdet i my.cnf, starta servern och kontrollera sedan felloggarna. Se även <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">det här blogginlägget</a>.

source: Timed out waiting for security key activation.
sv: Tidsgränsen överskreds i väntan på aktivering av säkerhetsnyckeln.

source: Show all
sv: Visa alla

source: Max InnoDB log size
sv: Maximal loggstorlek för innoDB

source: The number of tables that have been opened. If opened tables is big, your table_open_cache value is probably too small.
sv: Antalet tabeller som har öppnats. Om antalet öppnade tabeller är stort är värdet för table_open_cache sannolikt för litet.

source: Bookmarks
sv: Bokmärken

source: Allows creating foreign key relations.
sv: Tillåter skapande av främmande nyckel-relationer.

source: Analyze
sv: Analysera

source: This operation could take a long time. Proceed anyway?
sv: Denna operation kan ta lång tid. Fortsätt ändå?

source: An alias for BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE
sv: Ett alias för BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE

source: You have edited some data and they have not been saved. Are you sure you want to leave this page before saving the data?
sv: Du har redigerat en del data och de har inte sparats. Är du säker på att du vill lämna denna sida innan du sparar uppgifterna?

source: Save to selected page
sv: Spara till vald sida

source: One or more errors have occurred while processing your request:
sv: Ett eller flera fel har inträffat under hanteringen av din begäran:

source: The number of joins that do not use indexes. If this value is not 0, you should carefully check the indexes of your tables.
sv: Antalet kopplingar som inte använder index. Om detta värde inte är 0, bör du noggrant kontrollera index för dina tabeller.

source: The central list of columns for the current database is empty
sv: Huvudförteckningen över kolumner i den aktuella databasen är tom.

source: Rate of reading fixed position
sv: Andelen läsning av fast position

source: Aborted connections rate is at %s, this value should be less than 1 per hour
sv: Andelen avbrutna anslutningar är %s, det bör vara mindre än 1 per timme

source: [ROLLBACK occurred.]
sv: [ÅTERTOG tidigare version]

source: Has no effect in this MySQL version.
sv: Har ingen effekt i denna version av MySQL.

source: Default transformations for Hex
sv: Standardomvandlingar för hexadecimala värden

source: The size of the buffer used when writing a data log. The default is 256MB. The engine allocates one buffer per thread, but only if the thread is required to write a data log.
sv: Storleken på använd buffer vid skrivning av datalogg. Standardvärdet är 256MB. Motorn allokerar en buffer per tråd, men endast om tråden behöver skriva en datalogg.

source: Same width for all tables
sv: Samma bredd för alla tabeller

source: Use hexadecimal for BINARY & BLOB
sv: Använd hexadecimalt för BINARY & BLOB

source: Second step of normalization (1NF+2NF)
sv: Andra steget av normalisering (1NF + 2NF)

source: Could not load schema plugins, please check your installation!
sv: Kunde inte läsa in insticksprogram, kontrollera din installation!

source: Create a pma user and give access to these tables.
sv: Skapa en PMA användare och ge tillgång till dessa tabeller.

source: Truncate shown queries
sv: Förkorta visade frågor

source: Tab that is displayed when entering a table.
sv: Flik som visas när du går till en tabell.

source: Add search conditions (body of the "where" clause):
sv: Lägg till sökvillkor (uttryck i "where"-sats):

source: Edit inline
sv: Redigera infogade

source: Missing phpMyAdmin configuration storage tables
sv: Saknade phpMyAdmin konfiguration lagringstabeller

source: Show "Drop database" link to normal users
sv: Visa "Ta bort databas"-länk för normala användare

source: Can't copy table to same one!
sv: Kan inte kopiera tabell till samma en!

source: Row to begin at:
sv: Rad att börja på:

source: %s value
sv: %s värde

source: Insert
sv: Lägg till

source: This might be caused by {query_cache_limit} being too low. Flushing the query cache might help as well.
sv: Detta kan orsakas av {query_cache_limit} är satt för lågt. Tömma frågecachen kan också hjälpa.

source: Delete all cookies on logout
sv: Radera alla cookies vid utloggning

source: Insufficient space to save the file %s.
sv: Otillräckligt utrymme för att spara filen %s.

source: Export method:
sv: Exportmetod:

source: Structure for view
sv: Struktur för vy

source: Replication status
sv: Replikeringsstatus

source: Questions
sv: Frågor

source: Online transaction
sv: Online-transaktion

source: Error reading data for table %s:
sv: Fel vid läsning av data för tabellen %s:

source: Double-click to copy column name.
sv: Dubbelklicka för att kopiera kolumnnamn.

source: Swedish
sv: Svensk

source: Hide search criteria
sv: Dölj sökkriterier

source: The number of times that a table lock could not be acquired immediately and a wait was needed. If this is high, and you have performance problems, you should first optimize your queries, and then either split your table or tables or use replication.
sv: Antalet gånger som ett tabellås inte kunde förvärvas omedelbart och en väntan var nödvändig. Om detta värde är högt och du har prestandaproblem bör du först optimera dina frågor och antingen dela upp din tabell eller tabeller eller använda replikering.

source: Table %1$s has been altered successfully. Privileges have been adjusted.
sv: Tabellen %1$s har ändrats. Privilegierna har justerats.

source: CHAR textarea rows
sv: CHAR textarea rader

source: This table is a view, it can not be truncated.
sv: Tabellen är en vy och kan inte trunkeras.

source: Fri
sv: Fre

source: Renaming databases
sv: Byta namn på databaser

source: Unit
sv: Enhet

source: Your preferences will be saved for current session only. Storing them permanently requires %sphpMyAdmin configuration storage%s.
sv: Dina inställningar kommer enbart att sparas för den aktuella sessionen.För att lagra dem permanent krävs %sphpMyAdmin configuration storage%s.

source: Double size of textarea for LONGTEXT columns.
sv: Dubbel storlek på textområdet för LONGTEXT-kolumner.

source: NO
sv: NEJ

source: Use [code]LOCK TABLES[/code] statement
sv: Använd satsen [code]LOCK TABLES[/code]

source: SQL dump (file download)
sv: SQL-dump (filnedladdning)

source: Value for the column "%s"
sv: Värde för kolumn "%s"

source: The privileges were reloaded successfully.
sv: Privilegierna har laddats om.

source: Converts an Internet network address in (IPv4/IPv6) format into a long integer.
sv: Konverterar en Internetnätverksadress i formatet (IPv4/IPv6) till ett långt heltal.

source: Do a "query by example" (wildcard: "%") for two different columns
sv: Utför en "Query By Example" (jokertecken: "%") för två olika kolumner

source: Version check
sv: Versionskontroll

source: Mon
sv: Mån

source: Allow interrupt of import in case script detects it is close to time limit. This might be a good way to import large files, however it can break transactions.
sv: Tillåt avbrott av import ifall skriptet upptäcker att det är nära tidsbegränsningen. Detta kan vara ett bra sätt att importera stora filer, men det kan bryta transaktioner.

source: Effective
sv: Effektiv

source: Function to use when dumping data:
sv: Funktion att använda när data dumpas:

source: Only show keys
sv: Visa endast nycklar

source: in use
sv: används

source: No
sv: Nej

source: Drop partition
sv: Ta bort partition

source: Invalid column (%s) specified! Ensure that columns names are spelled correctly, separated by commas, and not enclosed in quotes.
sv: Ogiltig kolumn (%s)! Se till att kolumnernas namn är rättstavade, åtskilda med kommatecken och inte omges av citattecken.

source: No row selected.
sv: Ingen rad vald.

source: Autocomplete of the table and column names in the SQL queries.
sv: Automatisk komplettering av namn på tabell och kolumn i SQL-sökningar.

source: Custom
sv: Anpassad

source: cancel
sv: Avbryt

source: There is a lot of slow queries compared to the overall amount of Queries.
sv: Det är många långsamma frågor i förhållande till det totala antalet frågor.

source: Please enter a valid date or time
sv: Ange ett giltigt datum eller tid

source: Features
sv: Funktioner

source: Columns escaped with
sv: Specialtecken i fält föregås av

source: Data definition statement
sv: Data definition redogörelse

source: Column alias
sv: Kolumnalias

source: Search in database
sv: Sök i databas

source: The number of pages busy because they have been allocated for administrative overhead such as row locks or the adaptive hash index. This value can also be calculated as Innodb_buffer_pool_pages_total - Innodb_buffer_pool_pages_free - Innodb_buffer_pool_pages_data.
sv: Antalet upptagna sidor pga att de har blivit allokerade som administrativt extrautrymme för bl.a. radlås eller adaptivt hashindex. Detta värde kan också beräknas som Innodb_buffer_pool_pages_total - Innodb_buffer_pool_pages_free - Innodb_buffer_pool_pages_data.

source: A date, supported range is %1$s to %2$s
sv: Ett datum, supportat område är %1$s till %2$s

source: Displays the contents of the column as-is, without running it through htmlspecialchars(). That is, the column is assumed to contain valid HTML.
sv: Visar innehållet i kolumnen som det är, utan att köra det genom htmlspecialchars(). Det innebär att fältet antas innehålla korrekt HTML-kod.

source: The number of threads in the thread cache. The cache hit rate can be calculated as Threads_created/Connections. If this value is red you should raise your thread_cache_size.
sv: Antalet trådar i trådcachen. Cachens träffrekvens kan beräknas som Threads_created/Connections. Om detta värde är rött bör du öka värdet thread_cache_size.

source: X-Axis label:
sv: X-axel etikett:

source: Not enough privilege to view server status.
sv: Inte tillräckliga privilegier för att visa serverstatus.

source: As per your settings, they are being submitted currently, please be patient.
sv: Enligt dina inställningar, ha tålamod.

source: Server default
sv: Serverstandard

source: User groups management is not enabled.
sv: Hantering av användargrupper är inte aktiverad.

source: You are about to TRUNCATE a complete table!
sv: Du håller på att TRUNKERA en hel tabell!

source: Event %1$s has been created.
sv: Händelsen %1$s har skapats.

source: Schema of the %s database
sv: Schemat för %s databasen

source: Are you sure you wish to change all the column collations and convert the data?
sv: Är du säker på att du vill ändra alla de kolumn-sorteringar och konvertera data?

source: Create version %1$s
sv: Skapa version %1$s

source: Resource limits
sv: Resursbegränsningar

source: %sCreate%s a database named '%s' and setup the phpMyAdmin configuration storage there.
sv: %sCreate%s en databas heter "%s" och installera phpMyAdmin konfiguration lagring där.

source: The maximum size of the temporary file MySQL is allowed to use while re-creating a MyISAM index (during REPAIR TABLE, ALTER TABLE, or LOAD DATA INFILE).
sv: Denna maximala storleken för den temporära filen som MySQL är tillåten att använda under återskapande av MyISAM-index (vid REPAIR TABLE, ALTER TABLE, eller LOAD DATA INFILE).

source: Max_used_connections is at %s%% of max_connections, it should be below 80%%
sv: Max_used_connections är %s%% av max_connections. Det bör vara mindre än 80%%

source: Add a point
sv: Lägg till en punkt

source: Del
sv: Ta bort

source: Could not parse OpenDocument Spreadsheet!
sv: Kunde inte tolka OpenDocument-kalkylblad!

source: Invalid column count in CSV input on line %d.
sv: Ogiltigt antal kolumner i CSV-indata på rad %d.

source: Template was created.
sv: Mallen skapades.

source: Disabled
sv: Inaktiverad

source: The selected users have been deleted successfully.
sv: De valda användarna har tagits bort.

source: Where to show the table row links
sv: Var länkarna i tabellraden visas

source: Password:
sv: Lösenord:

source: case-sensitive
sv: Skiftlägeskänslig

source: Not enough privilege to view the advisor.
sv: Inte tillräcklig behörighet för att visa rådgivaren.

source: The $cfg['TempDir'] (%s) is not accessible. phpMyAdmin is not able to cache templates and will be slow because of this.
sv: $cfg['TempDir'] (%s) är inte åtkomlig. phpMyAdmin kan inte mellanlagra mallar och kommer därför att vara långsamt.

source: There is no detailed status information available for this storage engine.
sv: Det finns ingen detaljerad statusinformation tillgänglig för denna lagringsmotor.

source: Existing settings will be overwritten!
sv: Befintliga inställningar kommer skrivas över!

source: Requires a valid X509 certificate.
sv: Kräver ett giltigt X509 -certificate.

source: No Password
sv: Inget lösenord

source: Failed evaluating precondition for rule '%s'.
sv: Det gick inte att evaluera förutsättningen för regeln '%s'.

source: Trigger name
sv: Triggernamn

source: WebAuthn is not available. Please use a supported browser in a secure context (HTTPS).
sv: WebAuthn är inte tillgängligt. Använd en webbläsare med stöd i ett säkert sammanhang (HTTPS).

source: View %s has been dropped.
sv: Vyn %s har tagits bort.

source: Copy table with prefix
sv: Kopiera tabell med prefix

source: Bad type!
sv: Dålig typ!

source: The plot can be resized by dragging it along the bottom right corner.
sv: Kan ändra storlek genom att dra den längs nedre högra hörnet.

source: Log cache size
sv: Cachestorlek för logg

source: Left
sv: Vänster

source: Login using password only.
sv: Logga bara in med lösenord.

source: Taking you to the target site.
sv: Tar dig till målwebbplatsen.

source: Syntax highlighted CodeMirror editor for SQL.
sv: Syntaxmarkerad CodeMirror-redigerare för SQL.

source: Add chart
sv: Lägg till diagram

source: No files found inside ZIP archive!
sv: Inga filer hittades i ZIP-arkivet!

source: Routines
sv: Rutiner

source: Could not add columns!
sv: Kunde inte lägga till kolumner!

source: Loading
sv: Laddar…

source: The default pointer size in bytes, to be used by CREATE TABLE for MyISAM tables when no MAX_ROWS option is specified.
sv: Standardpekarens storlek i bytes, vilken används av CREATE TABLE för MyISAM-tabeller när inget MAX_ROWS-alternativ är specificerat.

source: Re-type
sv: Skriv igen

source: Format of imported file
sv: Format på importerad fil

source: The web server does not have permission to save the file %s.
sv: Webbservern har inte behörighet att spara filen %s.

source: Saved bookmarked search:
sv: Sparade bokmärkta sökningar:

source: Y values
sv: Y-värden

source: Adjust privileges
sv: Ändra privilegier

source: Ignore multiple statement errors
sv: Ignorera fel i fleruttrycksfrågor

source: The number of opened files is at %s%% of the limit. It should be below 85%%
sv: Antalet öppnade filer är %s%% av gränsvärdet. Det bör vara under 85%%

source: Authentication Application (2FA)
sv: Autentiseringsprogram (2FA)

source: Rename database to
sv: Byt namn på databasen till

source: Row marker
sv: Radmarkör

source: Not enough privilege to view server variables and settings. %s
sv: Inte tillräckliga privilegier för att visa servervariabler och inställningar. %s

source: Pick from Central Columns
sv: Välj från huvudkolumn

source: Hungarian
sv: Ungersk

source: 128-bit UUID (Universally Unique Identifier)
sv: 128-bitars UUID (universellt unik identifierare)

source: The definition of a stored function must contain a RETURN statement!
sv: Definitionen av en sparad funktion måste innehålla en RETURN-programsats!

source: Run SQL query/queries on server “%s”
sv: Kör SQL-fråga/frågor på servern ”%s”

source: Error in processing request
sv: Fel i processbegäran

source: active
sv: aktiv

source: Log data loaded. Queries executed in this time span:
sv: Loggdata laddad. Frågor utförda under denna tidsperiod:

source: Allows creating, dropping and renaming user accounts.
sv: Tillåter skapande, borttagning och omdöpning av användarkonton.

source: Rate of open files
sv: Andel öppna filer

source: There is an issue with your request.
sv: Det är ett problem med din begäran.

source: Percentage of temp tables on disk
sv: Andel temporära tabeller på disken

source: The phpMyAdmin configuration storage is not completely configured, some extended features have been deactivated. %sFind out why%s.
sv: phpMyAdmin-konfigurationen är inte fullständigt konfigurerad, vissa utökade funktioner har inaktiverats. För att ta reda på varför klicka %shär%s.

source: Any host
sv: Vilken värd som helst

source: Click reset zoom button to come back to original state.
sv: Klicka på återställningsknappen för att komma tillbaka till ursprungsläget.

source: Event
sv: Händelse

source: Please enter a valid URL
sv: Skriv in en giltig webbadress (URL)

source: Do you really want to delete the selected items?
sv: Vill du verkligen ta bort de markerade objekten?

source: Command
sv: Kommando

source: Check all
sv: Markera alla

source: Do you really want to delete this central column?
sv: Vill du verkligen ta bort denna centrala kolumn?

source: Client does not support security key.
sv: Klienten har inte stöd för säkerhetsnyckel.

source: Many temporary tables are being written to disk instead of being kept in memory.
sv: Många temporära tabeller skrivs till disken istället för att lagras i minnet.

source: Unable to connect to primary %s.
sv: Det går inte att ansluta till den primära servern %s.

source: Is InnoDB disabled?
sv: Är InnoDB inaktiverad?

source: Group name:
sv: Gruppnamn:

source: Leave blank for defaults.
sv: Lämna blankt för standardvärden.

source: per hour:
sv: per timme:

source: Available media types
sv: Tillgängliga medietyper

source: Failed attempts
sv: Misslyckade försök

source: The Advisor system can provide recommendations on server variables by analyzing the server status variables.
sv: Handledningssystemet kan ge rekommendationer på servervariabler genom att analysera serverstatusvariablerna.

source: Character set of the file:
sv: Teckenuppsättning för filen:

source: Select one…
sv: Välj en…

source: Slow_launch_time is above 2s.
sv: slow_launch_time är över 2 s.

source: Allows adding users and privileges without reloading the privilege tables.
sv: Tillåter inläggning av användare och privilegier utan omladdning av privilegietabeller.

source: Database structure
sv: Databasstruktur

source: Aborted client rate is at %s, this value should be less than 1 per hour
sv: Andelen avbrytna klienter är %s detta värde bör vara mindre än 1 per timme

source: Hovering over a point will show its label.
sv: Hovring över en punkt kommer visa dess etikett.

source: Page number:
sv: Sida nummer:

source: Name
sv: Namn

source: Sort order:
sv: Sorteringsordning:

source: Textarea columns
sv: Textarea kolumner

source: Danish
sv: Dansk

source: Setting variable failed
sv: Inställning av variabeln misslyckades

source: A type that can store a geometry of any type
sv: En typ som kan lagra en geometri av alla typer

source: Table tree separator
sv: Avskiljare för tabellträd

source: %1$d row inserted.
sv: %1$d rad infogad.

source: %1$d rows inserted.
sv: %1$d rader infogade.

source: Comment
sv: Kommentar

source: View in fullscreen
sv: Visa i helskärmsläge

source: You have a slow query rate of %s per hour, you should have less than 1%% per hour.
sv: Du har en långsam frågehastighet av %s per timme, du bör ha mindre än 1%% per timme.

source: On a busy server, the byte counters may overrun, so those statistics as reported by the MySQL server may be incorrect.
sv: På en upptagen server kan byte-räknare spåra ur, så statistiken som rapporteras av MySQL-servern kan vara fel.

source: Check the columns which are redundant and click on remove. If no redundant column, click on 'No redundant column'
sv: Markera de kolumner som är överflödiga och klicka på ta bort. Annars klickar du på "Ingen överflödig kolumn"

source: The [code]HTTP_HOST[/code] variable is missing, which might cause phpMyAdmin to not work properly. Please refer to [doc@faq1-46]documentation[/doc] for possible issues.
sv: Variabeln [code]HTTP_HOST[/code] saknas, vilket kan göra att phpMyAdmin inte fungerar korrekt. Se [doc@faq1-46]dokumentationen[/doc] om möjliga problem.

source: as regular expression
sv: som reguljärt uttryck

source: %s/sec.
sv: %s/sek.

source: neither of the above<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name VALUES (1,2,3)</code>
sv: inget av ovanstående<br> &nbsp; &nbsp; &nbsp; Exempel: <code>INSERT INTO tbl_name VALUES (1,2,3)</code>

source: Could not save configuration
sv: Kunde inte spara konfigurationen

source: There was an error in loading the Git information.
sv: Ett fel uppstod när Git-informationen lästes in.

source: Customize text input fields.
sv: Anpassa textfält.

source: Custom - display all possible options
sv: Anpassad - visa alla möjliga alternativ

source: The number of rows updated in InnoDB tables.
sv: Antalet rader uppdaterade i InnoDB-tabeller.

source: And
sv: Och

source: Highlight pointer
sv: Markera pekaren

source: Add columns to central list
sv: Lägg till kolumner i huvudlista

source: Current version: %s
sv: Nuvarande version: %s

source: Enter the URL for your reCAPTCHA v2 compatible API.
sv: Ange URL:en för ditt reCAPTCHA v2-kompatibla API.

source: Whether to show functions under database in the navigation tree
sv: Möjliggör funktionsvisning från databas i navigeringsträdet

source: Percentage of MyISAM key buffer used
sv: Andelen använd MyISAM key buffer

source: Subpartition
sv: Underpartition

source: Set import and export directories and compression options.
sv: Ange kataloger för import och export och komprimeringsalternativ.

source: Enclose table and column names with backquotes <i>(Protects column and table names formed with special characters or keywords)</i>
sv: Bifoga tabell-och kolumnnamn med backquote (`) <i>(Skyddar kolumn- och tabellnamn skapade med specialtecken eller nyckelord)</i>
